# Project X -- [First Name] [Last Name]

**TA Help:** John Smith, Alice Jones

- Help with figuring out how to write a function.
    
**Collaboration:** Friend1, Friend2
    
- Helped figuring out how to load the dataset.
- Helped debug error with my plot.

In [1]:
%load_ext sql

In [2]:
%sql sqlite:////anvil/projects/tdm/data/movies_and_tv/imdb.db

'Connected: @/anvil/projects/tdm/data/movies_and_tv/imdb.db'

## Question 1

In [7]:
%%sql

SELECT premiered AS year, COUNT(*) AS "movie count"
FROM titles 
WHERE title_id 
IN ('tt0371746', 'tt0800080', 'tt1228705', 'tt0800369', 'tt0458339', 'tt0848228', 'tt1300854', 'tt1981115', 'tt1843866', 'tt2015381', 'tt2395427', 'tt0478970', 'tt3498820', 'tt1211837', 'tt3896198', 'tt2250912', 'tt3501632', 'tt1825683', 'tt4154756', 'tt5095030', 'tt4154664', 'tt4154796', 'tt6320628', 'tt3480822', 'tt9032400', 'tt9376612', 'tt9419884', 'tt10648342', 'tt9114286') 
GROUP BY premiered;

 * sqlite:////anvil/projects/tdm/data/movies_and_tv/imdb.db
Done.

[(2008, 2),
 (2010, 1),
 (2011, 2),
 (2012, 1),
 (2013, 2),
 (2014, 2),
 (2015, 2),
 (2016, 2),
 (2017, 3),
 (2018, 3),
 (2019, 3),
 (2021, 3),
 (2022, 3)]

Markdown notes and sentences and analysis written here.

## Question 2

In [13]:
%%sql

SELECT premiered AS year, COUNT(*) AS "movie count", COUNT(*)/(SELECT COUNT(*) FROM titles WHERE title_id IN ('tt0371746', 'tt0800080', 'tt1228705', 'tt0800369', 'tt0458339', 'tt0848228', 'tt1300854', 'tt1981115', 'tt1843866', 'tt2015381', 'tt2395427', 'tt0478970', 'tt3498820', 'tt1211837', 'tt3896198', 'tt2250912', 'tt3501632', 'tt1825683', 'tt4154756', 'tt5095030', 'tt4154664', 'tt4154796', 'tt6320628', 'tt3480822', 'tt9032400', 'tt9376612', 'tt9419884', 'tt10648342', 'tt9114286') GROUP BY premiered) AS "percentage"
FROM titles 
WHERE title_id 
IN ('tt0371746', 'tt0800080', 'tt1228705', 'tt0800369', 'tt0458339', 'tt0848228', 'tt1300854', 'tt1981115', 'tt1843866', 'tt2015381', 'tt2395427', 'tt0478970', 'tt3498820', 'tt1211837', 'tt3896198', 'tt2250912', 'tt3501632', 'tt1825683', 'tt4154756', 'tt5095030', 'tt4154664', 'tt4154796', 'tt6320628', 'tt3480822', 'tt9032400', 'tt9376612', 'tt9419884', 'tt10648342', 'tt9114286') 
GROUP BY premiered;

 * sqlite:////anvil/projects/tdm/data/movies_and_tv/imdb.db
Done.

[(2008, 2, 1),
 (2010, 1, 0),
 (2011, 2, 1),
 (2012, 1, 0),
 (2013, 2, 1),
 (2014, 2, 1),
 (2015, 2, 1),
 (2016, 2, 1),
 (2017, 3, 1),
 (2018, 3, 1),
 (2019, 3, 1),
 (2021, 3, 1),
 (2022, 3, 1)]

Markdown notes and sentences and analysis written here.

## Question 3

In [ ]:
%%sql

SELECT premiered AS year, COUNT(*) AS "movie count", COUNT(*)/(SELECT COUNT(*) FROM titles WHERE title_id IN ('tt0371746', 'tt0800080', 'tt1228705', 'tt0800369', 'tt0458339', 'tt0848228', 'tt1300854', 'tt1981115', 'tt1843866', 'tt2015381', 'tt2395427', 'tt0478970', 'tt3498820', 'tt1211837', 'tt3896198', 'tt2250912', 'tt3501632', 'tt1825683', 'tt4154756', 'tt5095030', 'tt4154664', 'tt4154796', 'tt6320628', 'tt3480822', 'tt9032400', 'tt9376612', 'tt9419884', 'tt10648342', 'tt9114286') GROUP BY premiered) AS "percentage"
FROM titles 
WHERE title_id 
IN ('tt0371746', 'tt0800080', 'tt1228705', 'tt0800369', 'tt0458339', 'tt0848228', 'tt1300854', 'tt1981115', 'tt1843866', 'tt2015381', 'tt2395427', 'tt0478970', 'tt3498820', 'tt1211837', 'tt3896198', 'tt2250912', 'tt3501632', 'tt1825683', 'tt4154756', 'tt5095030', 'tt4154664', 'tt4154796', 'tt6320628', 'tt3480822', 'tt9032400', 'tt9376612', 'tt9419884', 'tt10648342', 'tt9114286') 
GROUP BY premiered;

Markdown notes and sentences and analysis written here.

## Question 4

In [ ]:
# code here

Markdown notes and sentences and analysis written here.

## Question 5

In [ ]:
# code here

Markdown notes and sentences and analysis written here.

## Pledge

By submitting this work I hereby pledge that this is my own, personal work. I've acknowledged in the designated place at the top of this file all sources that I used to complete said work, including but not limited to: online resources, books, and electronic communications. I've noted all collaboration with fellow students and/or TA's. I did not copy or plagiarize another's work.

> As a Boilermaker pursuing academic excellence, I pledge to be honest and true in all that I do. Accountable together â€“ We are Purdue.